Repository: HESPUL/django-zxcvbn-password-validator
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Your password is too guessable :
fr: Votre mot de passe est trop facile à deviner :

source: It would take an offline attacker {offline_time} to guess it.
fr: Le definer prendrait seulement {offline_time} à un hacker hors ligne.

source: Warning : {warn}.
fr: Attention : {warn}.

source: What you can do : {advice}.
fr: Ce que vous pouvez faire : {advice}.

source: Our password strength estimator is inspired by password crackers.
fr: Notre estimateur de force de mot de passe est inspiré par les cracker.

source: We do not force you to use an arbitraty number of lower, upper,
fr: Nous ne vous forçons pas à utiliser un nombre arbitraire de miniscules, majuscules,

source: numbers, symbols characters... but if we're able to crack your
fr: nombres et symboles... mais si nous sommes capables de cracker votre

source: password too easily you need to find another one.
fr: mot de passe facilement, vous devez en trouver un autre.

source: We expect
fr: Nous nous attendons à

source: a password that is not one of the 1000 most used worldwide.
fr: un mot de passe qui ne fait pas partie des 1000 les plus utilisés dans le monde.

source: a password that cannot be guessed by slow online attacks.
fr: un mot de passe qui ne ne peut pas être deviné par une attaque en ligne lente.

source: a password that cannot be guessed by fast online attacks.
fr: un mot de passe qui ne ne peut pas être deviné par une attaque en ligne rapide.

source: a password that could not be guessed if a lone engineer hacked into our database.
fr: un mot de passe qui ne ne pourrait pas être deviné par un ingénieur isolé ayant piraté notre base de données.

source: a password that could not be guessed if a large organisation hacked into our database.
fr: un mot de passe qui ne ne pourrait pas être deviné par une large organisation ayant piraté notre base de données.

source: our developpers to change the value for 'PASSWORD_MINIMAL_STRENGH' to something valid ASAP, sorry :)
fr: ce que nos développeurs change rapidement la valeur de "'PASSWORD_MINIMAL_STRENGH'" par une valeur valid aussi vite que possible, désolé :)

source: There is no specific rule for a great password,
fr: Il n'y a pas de règle absolu pour un bon mot de passe,

source: however if your password is too easy to guess
fr: cependant si votre mot de passe est trop facile à deviner

source: , we will tell you how to make a better one.
fr: , nous vous dirons comment l'améliorer.
